MikroElektronika/core_packages/PIC/XC8/def/PIC18F24K40/mcu.h
// Register: SSP1DATPPS
#define SSP1DATPPS SSP1DATPPS
extern volatile unsigned char           SSP1DATPPS          __at(0xEB8);
#ifndef _LIB_BUILD
asm("SSP1DATPPS equ 0EB8h");
#endif
// aliases
extern volatile unsigned char           SSPDATPPS           __at(0xEB8);
#ifndef _LIB_BUILD
asm("SSPDATPPS equ 0EB8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPDATPPS              :5;
    };
    struct {
        unsigned SSPDATPPS0             :1;
        unsigned SSPDATPPS1             :1;
        unsigned SSPDATPPS2             :1;
        unsigned SSPDATPPS3             :1;
        unsigned SSPDATPPS4             :1;
    };
    struct {
        unsigned SSP1DATPPS             :5;
    };
    struct {
        unsigned SSP1DATPPS0            :1;
        unsigned SSP1DATPPS1            :1;
        unsigned SSP1DATPPS2            :1;
        unsigned SSP1DATPPS3            :1;
        unsigned SSP1DATPPS4            :1;
    };
} SSP1DATPPSbits_t;
extern volatile SSP1DATPPSbits_t SSP1DATPPSbits __at(0xEB8);
// bitfield macros
#define _SSP1DATPPS_PIN_POSN                                0x0
#define _SSP1DATPPS_PIN_POSITION                            0x0
#define _SSP1DATPPS_PIN_SIZE                                0x3
#define _SSP1DATPPS_PIN_LENGTH                              0x3
#define _SSP1DATPPS_PIN_MASK                                0x7
#define _SSP1DATPPS_PORT_POSN                               0x3
#define _SSP1DATPPS_PORT_POSITION                           0x3
#define _SSP1DATPPS_PORT_SIZE                               0x2
#define _SSP1DATPPS_PORT_LENGTH                             0x2
#define _SSP1DATPPS_PORT_MASK                               0x18
#define _SSP1DATPPS_SSPDATPPS_POSN                          0x0
#define _SSP1DATPPS_SSPDATPPS_POSITION                      0x0
#define _SSP1DATPPS_SSPDATPPS_SIZE                          0x5
#define _SSP1DATPPS_SSPDATPPS_LENGTH                        0x5
#define _SSP1DATPPS_SSPDATPPS_MASK                          0x1F
#define _SSP1DATPPS_SSPDATPPS0_POSN                         0x0
#define _SSP1DATPPS_SSPDATPPS0_POSITION                     0x0
#define _SSP1DATPPS_SSPDATPPS0_SIZE                         0x1
#define _SSP1DATPPS_SSPDATPPS0_LENGTH                       0x1
#define _SSP1DATPPS_SSPDATPPS0_MASK                         0x1
#define _SSP1DATPPS_SSPDATPPS1_POSN                         0x1
#define _SSP1DATPPS_SSPDATPPS1_POSITION                     0x1
#define _SSP1DATPPS_SSPDATPPS1_SIZE                         0x1
#define _SSP1DATPPS_SSPDATPPS1_LENGTH                       0x1
#define _SSP1DATPPS_SSPDATPPS1_MASK                         0x2
#define _SSP1DATPPS_SSPDATPPS2_POSN                         0x2
#define _SSP1DATPPS_SSPDATPPS2_POSITION                     0x2
#define _SSP1DATPPS_SSPDATPPS2_SIZE                         0x1
#define _SSP1DATPPS_SSPDATPPS2_LENGTH                       0x1
#define _SSP1DATPPS_SSPDATPPS2_MASK                         0x4
#define _SSP1DATPPS_SSPDATPPS3_POSN                         0x3
#define _SSP1DATPPS_SSPDATPPS3_POSITION                     0x3
#define _SSP1DATPPS_SSPDATPPS3_SIZE                         0x1
#define _SSP1DATPPS_SSPDATPPS3_LENGTH                       0x1
#define _SSP1DATPPS_SSPDATPPS3_MASK                         0x8
#define _SSP1DATPPS_SSPDATPPS4_POSN                         0x4
#define _SSP1DATPPS_SSPDATPPS4_POSITION                     0x4
#define _SSP1DATPPS_SSPDATPPS4_SIZE                         0x1
#define _SSP1DATPPS_SSPDATPPS4_LENGTH                       0x1
#define _SSP1DATPPS_SSPDATPPS4_MASK                         0x10
#define _SSP1DATPPS_SSP1DATPPS_POSN                         0x0
#define _SSP1DATPPS_SSP1DATPPS_POSITION                     0x0
#define _SSP1DATPPS_SSP1DATPPS_SIZE                         0x5
#define _SSP1DATPPS_SSP1DATPPS_LENGTH                       0x5
#define _SSP1DATPPS_SSP1DATPPS_MASK                         0x1F
#define _SSP1DATPPS_SSP1DATPPS0_POSN                        0x0
#define _SSP1DATPPS_SSP1DATPPS0_POSITION                    0x0
#define _SSP1DATPPS_SSP1DATPPS0_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS0_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS0_MASK                        0x1
#define _SSP1DATPPS_SSP1DATPPS1_POSN                        0x1
#define _SSP1DATPPS_SSP1DATPPS1_POSITION                    0x1
#define _SSP1DATPPS_SSP1DATPPS1_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS1_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS1_MASK                        0x2
#define _SSP1DATPPS_SSP1DATPPS2_POSN                        0x2
#define _SSP1DATPPS_SSP1DATPPS2_POSITION                    0x2
#define _SSP1DATPPS_SSP1DATPPS2_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS2_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS2_MASK                        0x4
#define _SSP1DATPPS_SSP1DATPPS3_POSN                        0x3
#define _SSP1DATPPS_SSP1DATPPS3_POSITION                    0x3
#define _SSP1DATPPS_SSP1DATPPS3_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS3_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS3_MASK                        0x8
#define _SSP1DATPPS_SSP1DATPPS4_POSN                        0x4
#define _SSP1DATPPS_SSP1DATPPS4_POSITION                    0x4
#define _SSP1DATPPS_SSP1DATPPS4_SIZE                        0x1
#define _SSP1DATPPS_SSP1DATPPS4_LENGTH                      0x1
#define _SSP1DATPPS_SSP1DATPPS4_MASK                        0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPDATPPS              :5;
    };
    struct {
        unsigned SSPDATPPS0             :1;
        unsigned SSPDATPPS1             :1;
        unsigned SSPDATPPS2             :1;
        unsigned SSPDATPPS3             :1;
        unsigned SSPDATPPS4             :1;
    };
    struct {
        unsigned SSP1DATPPS             :5;
    };
    struct {
        unsigned SSP1DATPPS0            :1;
        unsigned SSP1DATPPS1            :1;
        unsigned SSP1DATPPS2            :1;
        unsigned SSP1DATPPS3            :1;
        unsigned SSP1DATPPS4            :1;
    };
} SSPDATPPSbits_t;
extern volatile SSPDATPPSbits_t SSPDATPPSbits __at(0xEB8);
// bitfield macros
#define _SSPDATPPS_PIN_POSN                                 0x0
#define _SSPDATPPS_PIN_POSITION                             0x0
#define _SSPDATPPS_PIN_SIZE                                 0x3
#define _SSPDATPPS_PIN_LENGTH                               0x3
#define _SSPDATPPS_PIN_MASK                                 0x7
#define _SSPDATPPS_PORT_POSN                                0x3
#define _SSPDATPPS_PORT_POSITION                            0x3
#define _SSPDATPPS_PORT_SIZE                                0x2
#define _SSPDATPPS_PORT_LENGTH                              0x2
#define _SSPDATPPS_PORT_MASK                                0x18
#define _SSPDATPPS_SSPDATPPS_POSN                           0x0
#define _SSPDATPPS_SSPDATPPS_POSITION                       0x0
#define _SSPDATPPS_SSPDATPPS_SIZE                           0x5
#define _SSPDATPPS_SSPDATPPS_LENGTH                         0x5
#define _SSPDATPPS_SSPDATPPS_MASK                           0x1F
#define _SSPDATPPS_SSPDATPPS0_POSN                          0x0
#define _SSPDATPPS_SSPDATPPS0_POSITION                      0x0
#define _SSPDATPPS_SSPDATPPS0_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS0_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS0_MASK                          0x1
#define _SSPDATPPS_SSPDATPPS1_POSN                          0x1
#define _SSPDATPPS_SSPDATPPS1_POSITION                      0x1
#define _SSPDATPPS_SSPDATPPS1_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS1_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS1_MASK                          0x2
#define _SSPDATPPS_SSPDATPPS2_POSN                          0x2
#define _SSPDATPPS_SSPDATPPS2_POSITION                      0x2
#define _SSPDATPPS_SSPDATPPS2_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS2_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS2_MASK                          0x4
#define _SSPDATPPS_SSPDATPPS3_POSN                          0x3
#define _SSPDATPPS_SSPDATPPS3_POSITION                      0x3
#define _SSPDATPPS_SSPDATPPS3_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS3_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS3_MASK                          0x8
#define _SSPDATPPS_SSPDATPPS4_POSN                          0x4
#define _SSPDATPPS_SSPDATPPS4_POSITION                      0x4
#define _SSPDATPPS_SSPDATPPS4_SIZE                          0x1
#define _SSPDATPPS_SSPDATPPS4_LENGTH                        0x1
#define _SSPDATPPS_SSPDATPPS4_MASK                          0x10
#define _SSPDATPPS_SSP1DATPPS_POSN                          0x0
#define _SSPDATPPS_SSP1DATPPS_POSITION                      0x0
#define _SSPDATPPS_SSP1DATPPS_SIZE                          0x5
#define _SSPDATPPS_SSP1DATPPS_LENGTH                        0x5
#define _SSPDATPPS_SSP1DATPPS_MASK                          0x1F
#define _SSPDATPPS_SSP1DATPPS0_POSN                         0x0
#define _SSPDATPPS_SSP1DATPPS0_POSITION                     0x0
#define _SSPDATPPS_SSP1DATPPS0_SIZE                         0x1
#define _SSPDATPPS_SSP1DATPPS0_LENGTH                       0x1
#define _SSPDATPPS_SSP1DATPPS0_MASK                         0x1
#define _SSPDATPPS_SSP1DATPPS1_POSN                         0x1
#define _SSPDATPPS_SSP1DATPPS1_POSITION                     0x1
#define _SSPDATPPS_SSP1DATPPS1_SIZE                         0x1
#define _SSPDATPPS_SSP1DATPPS1_LENGTH                       0x1
#define _SSPDATPPS_SSP1DATPPS1_MASK                         0x2
#define _SSPDATPPS_SSP1DATPPS2_POSN                         0x2
#define _SSPDATPPS_SSP1DATPPS2_POSITION                     0x2
#define _SSPDATPPS_SSP1DATPPS2_SIZE                         0x1
#define _SSPDATPPS_SSP1DATPPS2_LENGTH                       0x1
#define _SSPDATPPS_SSP1DATPPS2_MASK                         0x4
#define _SSPDATPPS_SSP1DATPPS3_POSN                         0x3
#define _SSPDATPPS_SSP1DATPPS3_POSITION                     0x3
#define _SSPDATPPS_SSP1DATPPS3_SIZE                         0x1
#define _SSPDATPPS_SSP1DATPPS3_LENGTH                       0x1
#define _SSPDATPPS_SSP1DATPPS3_MASK                         0x8
#define _SSPDATPPS_SSP1DATPPS4_POSN                         0x4
#define _SSPDATPPS_SSP1DATPPS4_POSITION                     0x4
#define _SSPDATPPS_SSP1DATPPS4_SIZE                         0x1
#define _SSPDATPPS_SSP1DATPPS4_LENGTH                       0x1
#define _SSPDATPPS_SSP1DATPPS4_MASK                         0x10

// Register: SSP1SSPPS
#define SSP1SSPPS SSP1SSPPS
extern volatile unsigned char           SSP1SSPPS           __at(0xEB9);
#ifndef _LIB_BUILD
asm("SSP1SSPPS equ 0EB9h");
#endif
// aliases
extern volatile unsigned char           SSPSSPPS            __at(0xEB9);
#ifndef _LIB_BUILD
asm("SSPSSPPS equ 0EB9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPSSPPS               :5;
    };
    struct {
        unsigned SSPSSPPS0              :1;
        unsigned SSPSSPPS1              :1;
        unsigned SSPSSPPS2              :1;
        unsigned SSPSSPPS3              :1;
        unsigned SSPSSPPS4              :1;
    };
    struct {
        unsigned SSP1SSPPS              :5;
    };
    struct {
        unsigned SSP1SSPPS0             :1;
        unsigned SSP1SSPPS1             :1;
        unsigned SSP1SSPPS2             :1;
        unsigned SSP1SSPPS3             :1;
        unsigned SSP1SSPPS4             :1;
    };
} SSP1SSPPSbits_t;
extern volatile SSP1SSPPSbits_t SSP1SSPPSbits __at(0xEB9);
// bitfield macros
#define _SSP1SSPPS_PIN_POSN                                 0x0
#define _SSP1SSPPS_PIN_POSITION                             0x0
#define _SSP1SSPPS_PIN_SIZE                                 0x3
#define _SSP1SSPPS_PIN_LENGTH                               0x3
#define _SSP1SSPPS_PIN_MASK                                 0x7
#define _SSP1SSPPS_PORT_POSN                                0x3
#define _SSP1SSPPS_PORT_POSITION                            0x3
#define _SSP1SSPPS_PORT_SIZE                                0x2
#define _SSP1SSPPS_PORT_LENGTH                              0x2
#define _SSP1SSPPS_PORT_MASK                                0x18
#define _SSP1SSPPS_SSPSSPPS_POSN                            0x0
#define _SSP1SSPPS_SSPSSPPS_POSITION                        0x0
#define _SSP1SSPPS_SSPSSPPS_SIZE                            0x5
#define _SSP1SSPPS_SSPSSPPS_LENGTH                          0x5
#define _SSP1SSPPS_SSPSSPPS_MASK                            0x1F
#define _SSP1SSPPS_SSPSSPPS0_POSN                           0x0
#define _SSP1SSPPS_SSPSSPPS0_POSITION                       0x0
#define _SSP1SSPPS_SSPSSPPS0_SIZE                           0x1
#define _SSP1SSPPS_SSPSSPPS0_LENGTH                         0x1
#define _SSP1SSPPS_SSPSSPPS0_MASK                           0x1
#define _SSP1SSPPS_SSPSSPPS1_POSN                           0x1
#define _SSP1SSPPS_SSPSSPPS1_POSITION                       0x1
#define _SSP1SSPPS_SSPSSPPS1_SIZE                           0x1
#define _SSP1SSPPS_SSPSSPPS1_LENGTH                         0x1
#define _SSP1SSPPS_SSPSSPPS1_MASK                           0x2
#define _SSP1SSPPS_SSPSSPPS2_POSN                           0x2
#define _SSP1SSPPS_SSPSSPPS2_POSITION                       0x2
#define _SSP1SSPPS_SSPSSPPS2_SIZE                           0x1
#define _SSP1SSPPS_SSPSSPPS2_LENGTH                         0x1
#define _SSP1SSPPS_SSPSSPPS2_MASK                           0x4
#define _SSP1SSPPS_SSPSSPPS3_POSN                           0x3
#define _SSP1SSPPS_SSPSSPPS3_POSITION                       0x3
#define _SSP1SSPPS_SSPSSPPS3_SIZE                           0x1
#define _SSP1SSPPS_SSPSSPPS3_LENGTH                         0x1
#define _SSP1SSPPS_SSPSSPPS3_MASK                           0x8
#define _SSP1SSPPS_SSPSSPPS4_POSN                           0x4
#define _SSP1SSPPS_SSPSSPPS4_POSITION                       0x4
#define _SSP1SSPPS_SSPSSPPS4_SIZE                           0x1
#define _SSP1SSPPS_SSPSSPPS4_LENGTH                         0x1
#define _SSP1SSPPS_SSPSSPPS4_MASK                           0x10
#define _SSP1SSPPS_SSP1SSPPS_POSN                           0x0
#define _SSP1SSPPS_SSP1SSPPS_POSITION                       0x0
#define _SSP1SSPPS_SSP1SSPPS_SIZE                           0x5
#define _SSP1SSPPS_SSP1SSPPS_LENGTH                         0x5
#define _SSP1SSPPS_SSP1SSPPS_MASK                           0x1F
#define _SSP1SSPPS_SSP1SSPPS0_POSN                          0x0
#define _SSP1SSPPS_SSP1SSPPS0_POSITION                      0x0
#define _SSP1SSPPS_SSP1SSPPS0_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS0_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS0_MASK                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_POSN                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_POSITION                      0x1
#define _SSP1SSPPS_SSP1SSPPS1_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS1_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS1_MASK                          0x2
#define _SSP1SSPPS_SSP1SSPPS2_POSN                          0x2
#define _SSP1SSPPS_SSP1SSPPS2_POSITION                      0x2
#define _SSP1SSPPS_SSP1SSPPS2_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS2_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS2_MASK                          0x4
#define _SSP1SSPPS_SSP1SSPPS3_POSN                          0x3
#define _SSP1SSPPS_SSP1SSPPS3_POSITION                      0x3
#define _SSP1SSPPS_SSP1SSPPS3_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS3_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS3_MASK                          0x8
#define _SSP1SSPPS_SSP1SSPPS4_POSN                          0x4
#define _SSP1SSPPS_SSP1SSPPS4_POSITION                      0x4
#define _SSP1SSPPS_SSP1SSPPS4_SIZE                          0x1
#define _SSP1SSPPS_SSP1SSPPS4_LENGTH                        0x1
#define _SSP1SSPPS_SSP1SSPPS4_MASK                          0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned SSPSSPPS               :5;
    };
    struct {
        unsigned SSPSSPPS0              :1;
        unsigned SSPSSPPS1              :1;
        unsigned SSPSSPPS2              :1;
        unsigned SSPSSPPS3              :1;
        unsigned SSPSSPPS4              :1;
    };
    struct {
        unsigned SSP1SSPPS              :5;
    };
    struct {
        unsigned SSP1SSPPS0             :1;
        unsigned SSP1SSPPS1             :1;
        unsigned SSP1SSPPS2             :1;
        unsigned SSP1SSPPS3             :1;
        unsigned SSP1SSPPS4             :1;
    };
} SSPSSPPSbits_t;
extern volatile SSPSSPPSbits_t SSPSSPPSbits __at(0xEB9);
// bitfield macros
#define _SSPSSPPS_PIN_POSN                                  0x0
#define _SSPSSPPS_PIN_POSITION                              0x0
#define _SSPSSPPS_PIN_SIZE                                  0x3
#define _SSPSSPPS_PIN_LENGTH                                0x3
#define _SSPSSPPS_PIN_MASK                                  0x7
#define _SSPSSPPS_PORT_POSN                                 0x3
#define _SSPSSPPS_PORT_POSITION                             0x3
#define _SSPSSPPS_PORT_SIZE                                 0x2
#define _SSPSSPPS_PORT_LENGTH                               0x2
#define _SSPSSPPS_PORT_MASK                                 0x18
#define _SSPSSPPS_SSPSSPPS_POSN                             0x0
#define _SSPSSPPS_SSPSSPPS_POSITION                         0x0
#define _SSPSSPPS_SSPSSPPS_SIZE                             0x5
#define _SSPSSPPS_SSPSSPPS_LENGTH                           0x5
#define _SSPSSPPS_SSPSSPPS_MASK                             0x1F
#define _SSPSSPPS_SSPSSPPS0_POSN                            0x0
#define _SSPSSPPS_SSPSSPPS0_POSITION                        0x0
#define _SSPSSPPS_SSPSSPPS0_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS0_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS0_MASK                            0x1
#define _SSPSSPPS_SSPSSPPS1_POSN                            0x1
#define _SSPSSPPS_SSPSSPPS1_POSITION                        0x1
#define _SSPSSPPS_SSPSSPPS1_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS1_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS1_MASK                            0x2
#define _SSPSSPPS_SSPSSPPS2_POSN                            0x2
#define _SSPSSPPS_SSPSSPPS2_POSITION                        0x2
#define _SSPSSPPS_SSPSSPPS2_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS2_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS2_MASK                            0x4
#define _SSPSSPPS_SSPSSPPS3_POSN                            0x3
#define _SSPSSPPS_SSPSSPPS3_POSITION                        0x3
#define _SSPSSPPS_SSPSSPPS3_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS3_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS3_MASK                            0x8
#define _SSPSSPPS_SSPSSPPS4_POSN                            0x4
#define _SSPSSPPS_SSPSSPPS4_POSITION                        0x4
#define _SSPSSPPS_SSPSSPPS4_SIZE                            0x1
#define _SSPSSPPS_SSPSSPPS4_LENGTH                          0x1
#define _SSPSSPPS_SSPSSPPS4_MASK                            0x10
#define _SSPSSPPS_SSP1SSPPS_POSN                            0x0
#define _SSPSSPPS_SSP1SSPPS_POSITION                        0x0
#define _SSPSSPPS_SSP1SSPPS_SIZE                            0x5
#define _SSPSSPPS_SSP1SSPPS_LENGTH                          0x5
#define _SSPSSPPS_SSP1SSPPS_MASK                            0x1F
#define _SSPSSPPS_SSP1SSPPS0_POSN                           0x0
#define _SSPSSPPS_SSP1SSPPS0_POSITION                       0x0
#define _SSPSSPPS_SSP1SSPPS0_SIZE                           0x1
#define _SSPSSPPS_SSP1SSPPS0_LENGTH                         0x1
#define _SSPSSPPS_SSP1SSPPS0_MASK                           0x1
#define _SSPSSPPS_SSP1SSPPS1_POSN                           0x1
#define _SSPSSPPS_SSP1SSPPS1_POSITION                       0x1
#define _SSPSSPPS_SSP1SSPPS1_SIZE                           0x1
#define _SSPSSPPS_SSP1SSPPS1_LENGTH                         0x1
#define _SSPSSPPS_SSP1SSPPS1_MASK                           0x2
#define _SSPSSPPS_SSP1SSPPS2_POSN                           0x2
#define _SSPSSPPS_SSP1SSPPS2_POSITION                       0x2
#define _SSPSSPPS_SSP1SSPPS2_SIZE                           0x1
#define _SSPSSPPS_SSP1SSPPS2_LENGTH                         0x1
#define _SSPSSPPS_SSP1SSPPS2_MASK                           0x4
#define _SSPSSPPS_SSP1SSPPS3_POSN                           0x3
#define _SSPSSPPS_SSP1SSPPS3_POSITION                       0x3
#define _SSPSSPPS_SSP1SSPPS3_SIZE                           0x1
#define _SSPSSPPS_SSP1SSPPS3_LENGTH                         0x1
#define _SSPSSPPS_SSP1SSPPS3_MASK                           0x8
#define _SSPSSPPS_SSP1SSPPS4_POSN                           0x4
#define _SSPSSPPS_SSP1SSPPS4_POSITION                       0x4
#define _SSPSSPPS_SSP1SSPPS4_SIZE                           0x1
#define _SSPSSPPS_SSP1SSPPS4_LENGTH                         0x1
#define _SSPSSPPS_SSP1SSPPS4_MASK                           0x10

// Register: IPR0
#define IPR0 IPR0
extern volatile unsigned char           IPR0                __at(0xEBA);
#ifndef _LIB_BUILD
asm("IPR0 equ 0EBAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IP                 :1;
        unsigned INT1IP                 :1;
        unsigned INT2IP                 :1;
        unsigned                        :1;
        unsigned IOCIP                  :1;
        unsigned TMR0IP                 :1;
    };
} IPR0bits_t;
