MikroElektronika/core_packages/PIC/XC8/def/PIC18F24K40/mcu.h
extern volatile IPR0bits_t IPR0bits __at(0xEBA);
// bitfield macros
#define _IPR0_INT0IP_POSN                                   0x0
#define _IPR0_INT0IP_POSITION                               0x0
#define _IPR0_INT0IP_SIZE                                   0x1
#define _IPR0_INT0IP_LENGTH                                 0x1
#define _IPR0_INT0IP_MASK                                   0x1
#define _IPR0_INT1IP_POSN                                   0x1
#define _IPR0_INT1IP_POSITION                               0x1
#define _IPR0_INT1IP_SIZE                                   0x1
#define _IPR0_INT1IP_LENGTH                                 0x1
#define _IPR0_INT1IP_MASK                                   0x2
#define _IPR0_INT2IP_POSN                                   0x2
#define _IPR0_INT2IP_POSITION                               0x2
#define _IPR0_INT2IP_SIZE                                   0x1
#define _IPR0_INT2IP_LENGTH                                 0x1
#define _IPR0_INT2IP_MASK                                   0x4
#define _IPR0_IOCIP_POSN                                    0x4
#define _IPR0_IOCIP_POSITION                                0x4
#define _IPR0_IOCIP_SIZE                                    0x1
#define _IPR0_IOCIP_LENGTH                                  0x1
#define _IPR0_IOCIP_MASK                                    0x10
#define _IPR0_TMR0IP_POSN                                   0x5
#define _IPR0_TMR0IP_POSITION                               0x5
#define _IPR0_TMR0IP_SIZE                                   0x1
#define _IPR0_TMR0IP_LENGTH                                 0x1
#define _IPR0_TMR0IP_MASK                                   0x20

// Register: IPR1
#define IPR1 IPR1
extern volatile unsigned char           IPR1                __at(0xEBB);
#ifndef _LIB_BUILD
asm("IPR1 equ 0EBBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIP                   :1;
        unsigned ADTIP                  :1;
        unsigned                        :4;
        unsigned CSWIP                  :1;
        unsigned OSCFIP                 :1;
    };
    struct {
        unsigned                        :7;
        unsigned PSPIP                  :1;
    };
} IPR1bits_t;
extern volatile IPR1bits_t IPR1bits __at(0xEBB);
// bitfield macros
#define _IPR1_ADIP_POSN                                     0x0
#define _IPR1_ADIP_POSITION                                 0x0
#define _IPR1_ADIP_SIZE                                     0x1
#define _IPR1_ADIP_LENGTH                                   0x1
#define _IPR1_ADIP_MASK                                     0x1
#define _IPR1_ADTIP_POSN                                    0x1
#define _IPR1_ADTIP_POSITION                                0x1
#define _IPR1_ADTIP_SIZE                                    0x1
#define _IPR1_ADTIP_LENGTH                                  0x1
#define _IPR1_ADTIP_MASK                                    0x2
#define _IPR1_CSWIP_POSN                                    0x6
#define _IPR1_CSWIP_POSITION                                0x6
#define _IPR1_CSWIP_SIZE                                    0x1
#define _IPR1_CSWIP_LENGTH                                  0x1
#define _IPR1_CSWIP_MASK                                    0x40
#define _IPR1_OSCFIP_POSN                                   0x7
#define _IPR1_OSCFIP_POSITION                               0x7
#define _IPR1_OSCFIP_SIZE                                   0x1
#define _IPR1_OSCFIP_LENGTH                                 0x1
#define _IPR1_OSCFIP_MASK                                   0x80
#define _IPR1_PSPIP_POSN                                    0x7
#define _IPR1_PSPIP_POSITION                                0x7
#define _IPR1_PSPIP_SIZE                                    0x1
#define _IPR1_PSPIP_LENGTH                                  0x1
#define _IPR1_PSPIP_MASK                                    0x80

// Register: IPR2
#define IPR2 IPR2
extern volatile unsigned char           IPR2                __at(0xEBC);
#ifndef _LIB_BUILD
asm("IPR2 equ 0EBCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1IP                   :1;
        unsigned C2IP                   :1;
        unsigned                        :4;
        unsigned ZCDIP                  :1;
        unsigned HLVDIP                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned CMIP                   :1;
    };
} IPR2bits_t;
extern volatile IPR2bits_t IPR2bits __at(0xEBC);
// bitfield macros
#define _IPR2_C1IP_POSN                                     0x0
#define _IPR2_C1IP_POSITION                                 0x0
#define _IPR2_C1IP_SIZE                                     0x1
#define _IPR2_C1IP_LENGTH                                   0x1
#define _IPR2_C1IP_MASK                                     0x1
#define _IPR2_C2IP_POSN                                     0x1
#define _IPR2_C2IP_POSITION                                 0x1
#define _IPR2_C2IP_SIZE                                     0x1
#define _IPR2_C2IP_LENGTH                                   0x1
#define _IPR2_C2IP_MASK                                     0x2
#define _IPR2_ZCDIP_POSN                                    0x6
#define _IPR2_ZCDIP_POSITION                                0x6
#define _IPR2_ZCDIP_SIZE                                    0x1
#define _IPR2_ZCDIP_LENGTH                                  0x1
#define _IPR2_ZCDIP_MASK                                    0x40
#define _IPR2_HLVDIP_POSN                                   0x7
#define _IPR2_HLVDIP_POSITION                               0x7
#define _IPR2_HLVDIP_SIZE                                   0x1
#define _IPR2_HLVDIP_LENGTH                                 0x1
#define _IPR2_HLVDIP_MASK                                   0x80
#define _IPR2_CMIP_POSN                                     0x6
#define _IPR2_CMIP_POSITION                                 0x6
#define _IPR2_CMIP_SIZE                                     0x1
#define _IPR2_CMIP_LENGTH                                   0x1
#define _IPR2_CMIP_MASK                                     0x40

// Register: IPR3
#define IPR3 IPR3
extern volatile unsigned char           IPR3                __at(0xEBD);
#ifndef _LIB_BUILD
asm("IPR3 equ 0EBDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSPIP                  :1;
        unsigned BCLIP                  :1;
        unsigned                        :2;
        unsigned TXIP                   :1;
        unsigned RCIP                   :1;
    };
    struct {
        unsigned SSP1IP                 :1;
        unsigned BCL1IP                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned RXBNIP                 :1;
        unsigned                        :2;
        unsigned TXBNIP                 :1;
    };
} IPR3bits_t;
extern volatile IPR3bits_t IPR3bits __at(0xEBD);
// bitfield macros
#define _IPR3_SSPIP_POSN                                    0x0
#define _IPR3_SSPIP_POSITION                                0x0
#define _IPR3_SSPIP_SIZE                                    0x1
#define _IPR3_SSPIP_LENGTH                                  0x1
#define _IPR3_SSPIP_MASK                                    0x1
#define _IPR3_BCLIP_POSN                                    0x1
#define _IPR3_BCLIP_POSITION                                0x1
#define _IPR3_BCLIP_SIZE                                    0x1
#define _IPR3_BCLIP_LENGTH                                  0x1
#define _IPR3_BCLIP_MASK                                    0x2
#define _IPR3_TXIP_POSN                                     0x4
#define _IPR3_TXIP_POSITION                                 0x4
#define _IPR3_TXIP_SIZE                                     0x1
#define _IPR3_TXIP_LENGTH                                   0x1
#define _IPR3_TXIP_MASK                                     0x10
#define _IPR3_RCIP_POSN                                     0x5
#define _IPR3_RCIP_POSITION                                 0x5
#define _IPR3_RCIP_SIZE                                     0x1
#define _IPR3_RCIP_LENGTH                                   0x1
#define _IPR3_RCIP_MASK                                     0x20
#define _IPR3_SSP1IP_POSN                                   0x0
#define _IPR3_SSP1IP_POSITION                               0x0
#define _IPR3_SSP1IP_SIZE                                   0x1
#define _IPR3_SSP1IP_LENGTH                                 0x1
#define _IPR3_SSP1IP_MASK                                   0x1
#define _IPR3_BCL1IP_POSN                                   0x1
#define _IPR3_BCL1IP_POSITION                               0x1
#define _IPR3_BCL1IP_SIZE                                   0x1
#define _IPR3_BCL1IP_LENGTH                                 0x1
#define _IPR3_BCL1IP_MASK                                   0x2
#define _IPR3_RXBNIP_POSN                                   0x1
#define _IPR3_RXBNIP_POSITION                               0x1
#define _IPR3_RXBNIP_SIZE                                   0x1
#define _IPR3_RXBNIP_LENGTH                                 0x1
#define _IPR3_RXBNIP_MASK                                   0x2
#define _IPR3_TXBNIP_POSN                                   0x4
#define _IPR3_TXBNIP_POSITION                               0x4
#define _IPR3_TXBNIP_SIZE                                   0x1
#define _IPR3_TXBNIP_LENGTH                                 0x1
#define _IPR3_TXBNIP_MASK                                   0x10

